

//дом. задания
//1. Вам дана переменная a. Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Неверно'.
//let a = 10
//a = 10 ? console.log ("yes") : console.log ("no")

//2. Вам даны две переменные a=50, b=100. Составьте условие, по которому в консоль будет выводиться 'a больше b', 'a меньше b'.
//let a = 50
//let b = 100
//if (a > b)
//{console.log ("a < b")}
//else if ("a > b") {console.log("a > b")}

//3. Вам дана переменная a=-2. Составьте условие, по которому в консоль будет выводиться 'positive' - если число больше 0, 'равно' если число равно 0, "negative" если число меньше 0.
//let a =- 2
//if(a < 0)
//{ console.log("positiv");}
//else if (a = 0)
//{console.log("a < 0")}
//else {console.log("negativ")}

//4. Вам дана переменная number=45. Составьте условие, по которому будет выводиться в консоль "Четное число", "Нечетное число".
//let a = 45
//a -=5
//console.log(a);
//5. Вам даны две переменные a=10, b=2. Составьте условие, по которому, остаток деления a на b, будет выводиться консоль "Четное число", "Нечетное число".
//let a = 10
//let b = 2
//console.log(a / b);

//6. Вам дана переменная s. Составьте условие, по которому в консоль будет выводится тип этой переменной - "boolean", "number", "string".
//let s
//console.log(typeof "a");
//console.log(typeof 4);
//console.log(typeof false);
//7. Вам дана переменная а. Если переменная a больше одного и меньше 9-ти, то выведите 'Верно', иначе выведите 'Неверно'.
//let a = Math.ceil(Math.random() * 10)
//1 > 10 ? console.log("ne verno") : console.log("verno") 
//let a = "5678957L"
//console.log(a[a.length - 1]);
let a = "hello world"
console.log(a.substr(1,4));